app/controllers/departments_controller.rb

  def list
    @address = get_address
    @start = (params[:start] || '1').to_i
    @end = (params[:end] || '7').to_i
    @next = @address+"/departments?start="+(@end+1).to_s+"&end="+(@end+1+@end-@start).to_s

    @departments = Department.find(:all, :order => "department_name", :offset => @start.to_i-1, :limit => @end.to_i+1-@start.to_i)

    if @departments.count != @end+1-@start then
---
SELECT `departments`.* FROM `departments` ORDER BY department_name LIMIT 7 OFFSET 0

  def specific
    @department = Department.find(params[:id])
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 5 LIMIT 1