app/controllers/org_units_controller.rb

  def search
    @address = get_address
    @keyword = params[:keyword].gsub("%", "\%").gsub("_", "\_")
    @start = params[:start] || '1'
    @end = params[:end] || '20'
    @next = @end.to_i+1

    departments = Department.find(:all, :order=> "department_name", :conditions=> ["department_name like ?", "%"+@keyword+"%"])
    organs = Organ.find(:all, :order=> "organ_name", :conditions=> ["organ_name like ?", "%"+@keyword+"%"])
    services = Service.find(:all, :order=> "service_name", :conditions=> ["service_name like ?", "%"+@keyword+"%"])
---
SELECT `departments`.* FROM `departments` WHERE (department_name like '%joao%') ORDER BY department_name
SELECT `organs`.* FROM `organs` WHERE (organ_name like '%joao%') ORDER BY organ_name
SELECT `services`.* FROM `services` WHERE (service_name like '%joao%') ORDER BY service_name