app/controllers/organs_controller.rb

  def list
    @address = get_address
    @start = (params[:start] || '1').to_i
    @end = (params[:end] || '5').to_i
    @next = @address+"/organs?start="+(@end+1).to_s+"&end="+(@end+1+@end-@start).to_s

    @organs = Organ.find(:all, :order => "organ_name", :offset => @start-1, :limit => @end+1-@start)

     if @organs.count != @end+1-@start then
---
SELECT `organs`.* FROM `organs` ORDER BY organ_name LIMIT 7 OFFSET 0

  def specific
    @organs = Organ.find(params[:id])
    @secretary = Secretary.where(:organ_id => @organs)
---
SELECT `organs`.* FROM `organs` WHERE `organs`.`id` = 7 LIMIT 1
SELECT `secretaries`.* FROM `secretaries` WHERE `secretaries`.`organ_id` = 7