app/controllers/services_controller.rb

  def list
    @address = get_address
    @start = (params[:start] || '1').to_i
    @end = (params[:end] || '7').to_i
    @next = @address+"/services?start="+(@end+1).to_s+"&end="+(@end+1+@end-@start).to_s

    @services = Service.find(:all, :order => "service_name", :offset => @start.to_i-1, :limit => @end.to_i+1-@start.to_i)

     if @services.count != @end+1-@start then
---
SELECT `services`.* FROM `services` ORDER BY service_name LIMIT 7 OFFSET 0

  def specific
    @address = get_address
    @services = Service.find(params[:id])
    @sections = Section.where(:service_id => @services)
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 4 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`service_id` = 4